//
// Created by ayttekao on 5/14/21.
//

#ifndef FUNDI_COURSEWORK_4_SEMESTER__POPULATIONCENSUS_H
#define FUNDI_COURSEWORK_4_SEMESTER__POPULATIONCENSUS_H
#include "customTypes.h"
#include <random>
#include <set>
#include <utility>
#include <vector>
#include <list>
#include <memory>

#define MAX_NUM_OF_SECONDS (5*365*24*60*60) // number of seconds in 5 years

struct tm* GetTimeAndDate()
{
    unsigned int now_seconds  = (unsigned int)time(nullptr);
    unsigned int rand_seconds = (rand()*rand())%(MAX_NUM_OF_SECONDS+1);
    time_t       rand_time    = (time_t)(now_seconds-rand_seconds);
    return localtime(&rand_time);
}

std::string randomString(size_t length)
{
    auto randChar = []() -> char
    {
        static std::random_device rd;
        std::default_random_engine generator(rd());
        std::uniform_int_distribution<unsigned int> distribution(0, 25);
        const char charset[] =
                "abcdefghijklmnopqrstuvwxyz";
        return charset[ distribution(generator) ];
    };
    std::string str(length,0);
    std::generate_n(str.begin(), length, randChar );
    return str;
}

class PopulationCensus
{
protected:
    /*1*/uint16_t        enumerationAreaNumber; /* номер переписного участка */
    /*2*/uint16_t        householdNumberWithinTheEnumerationArea; /* номер помещения в пределах счетного участка */
    /*3*/uint16_t        formNumber; /* номер бланка */
    /*4*/std::string     fullName; /* ваше имя */
    /*5*/gender          selectedGender; /* ваш пол */
    /*6*/struct tm*      birthDay; /* дата вашего рождения */
    /*7*/uint8_t         numberOfYears; /* число полных лет */
    /*8*/marriageAnswer  marriageInfo; /* ваше состояние в браке */
    /*9*/yesNoAnswer     thatPersonSpouseLivesHousehold; /* супруг(а) этого лица проживает в домохозяйстве */
    /*10*/uint8_t         amountOfChildren; /* сколько детей вы родили */
    /*11*/struct tm*      birthDayFirstChild; /* год рождения первого ребенка */
    /*12*/std::string     placeOfBirth; /* место вашего рождения */
    /*13*/uint8_t         yearOfContinuousResidence; /* с какого года вы непрерывно проживаете в этом населенном пункте */
    /*14*/std::string     previousPlaceOfResidence; /* ваше пржднее место жительства */
    /*15*/yesNoAnswer     livedInOtherCountries; /* проживали ли выболее 12 месяцев в других странах */
    /*16*/std::string     placeOfResidenceToArrivalInRussia; /* где вы проживали до прибытия в Россию (если выбрано проживание
                                                    * в других странах) */
    /*17*/uint8_t         yearsOfComebackToRussia; /* год прибытия (возвращения) в Россию */
    /*18*/yesNoAnswer     proficiencyInRussian; /* владаете ли вы русским языком */
    /*19*/yesNoAnswer     useOfRussianLanguageInEverydayLife; /* используете ли вы его в повседневной жизни */
    /*20*/std::set<std::string> languages; /* какими иными языками вы владеете */
    /*21*/std::string     nativeLanguage; /* ваш родной язык */
    /*22*/std::string     citizenship; /* ваше гражданство */
    /*23*/std::string     nationality; /* ваша национальная принадлежность */
    /*24*/yesNoAnswer     abilityReadAndWrite; /* умеете ли вы читать и писать (если выбрано не имею образования) */
    /*25*/typeOfDegree    academicDegree; /* имеете ли вы ученую степень (для лиц с высшим образованием и кадров высшей квалификации) */
    /*26*/yesNoAnswer     currentEducation; /* получаете ли вы образование в настоящее время */
    /*27*/std::set<studyingPrograms> currentEducationPrograms; /* отметье все программы по которым обучаетесь (если есть текущее образование) */
    /*28*/std::set<typesOfLivelihoods> livelihoods; /* укажите все имеющиеся у вас источники средств к существованию */
    /*29*/typesOfLivelihoods mainLivelihood; /* какой из отмеченных источников вы считаете для себя основным */
    /*30*/yesNoAnswer     workForCertainPeriod; /* имели ли вы какую-либо оплачиваемую работу или доходное занятие с 25 по 31 марта 2021 года */
    /*31*/positionAtWork  positionMainJob; /* кем вы являлись на основной работе */
    /*32*/yesNoAnswer     mainWorkWasInTheSameSettlement; /* ваша основная работа находилась в том же населенном пункте, где вы проживаете постоянно */
    /*33*/typeInformationAboutWork informationAboutWork; /* где находилась ваша основная работа */
    /*34*/workScheduleOptions schedule; /* вы выезжали(выходили) на работу */
    /*35*/jobOptionsMarch     suitableJobInMarch; /* если бы вам предложили подходящую работу в последнюю неделю марта,
                                        * то когда вы смогли бы приступить к ней */
    /*36*/yesNoAnswer                 jobSearchInMarch; /* вы искали работу в течении марта */
    /*37*/mainReasonWorkMarch         jobSearchDuringMarch; /* вы искали работу в течении марта */
    /*38*/registrationInfoInHousehold registrationInThisHousehold; /* зарегистрированы ли вы в этом помещении */
    /*39*/residenceRegistrationInfo   residenceRegistration; /* где вы зарегистрировваны по месту жительства */

    static yesNoAnswer generateYesNo()
    {
        static std::random_device rd;
        std::default_random_engine generator(rd());
        std::uniform_int_distribution<unsigned int> distribution(0, 1);
        auto answer = static_cast<yesNoAnswer>(distribution(generator));
        return answer;
    };

    static gender generateGender()
    {
        static std::random_device rd;
        std::default_random_engine generator(rd());
        std::uniform_int_distribution<unsigned int> distribution(0, 1);
        auto answer = static_cast<gender>(distribution(generator));
        return answer;
    }

    static marriageAnswer generateMarriageAnswer()
    {
        static std::random_device rd;
        std::default_random_engine generator(rd());
        std::uniform_int_distribution<unsigned int> distribution(0, 5);
